#pragma once
#include <iostream>
using namespace std;
void rulesProgramm() {
	cout << "\t\t\t\t\t\t\t\t######################################################################################################################" << endl;
	cout << "\t\t\t\t\t\t\t\t#                                         Правила пользования программой                                             #" << endl;                                  
	cout << "\t\t\t\t\t\t\t\t#                                                                                                                    #" << endl;
	cout << "\t\t\t\t\t\t\t\t#  N1. Поиск выполняется строго по описанным критериям т.е.  Eсли написано > Поиск файла по расширению то поиск      #" << endl;
	cout << "\t\t\t\t\t\t\t\t#     будет вестись только по расширениям (.txt .bat .exe и другим).                                                 #" << endl;
	cout << "\t\t\t\t\t\t\t\t#                                                                                                                    #" << endl;
	cout << "\t\t\t\t\t\t\t\t#  N2. Соблюдайте синтаксис, при написании пути к директории НЕ НУЖНО ставить пробелы. Пример: E:\\ programm \\main    #" << endl;
	cout << "\t\t\t\t\t\t\t\t#     так нельзя делать, нужно делать так: E:\\programm\\main.                                                         #" << endl;
	cout << "\t\t\t\t\t\t\t\t#                                                                                                                    #" << endl;
	cout << "\t\t\t\t\t\t\t\t#  N3. Права администратора дают возможность поиска файлов в системных директориях. При запуске без прав иногда      #" << endl;
	cout << "\t\t\t\t\t\t\t\t#      будет возникать ошибка 'System Volume Information'. Исправить её можно при помощи запуска от имени админа     #" << endl;
	cout << "\t\t\t\t\t\t\t\t#                                                                                                                    #" << endl;
	cout << "\t\t\t\t\t\t\t\t#                                                                                                                    #" << endl;

}