#pragma once
#include <iostream>
using namespace std;
void rulesProgramm() {
	cout << "\t\t\t\t\t\t\t\t###############################################################################################################" << endl;
	cout << "\t\t\t\t\t\t\t\t#                                         Правила пользования программой                                      #" << endl;                                  
	cout << "\t\t\t\t\t\t\t\t#                                                                                                             #" << endl;
	cout << "\t\t\t\t\t\t\t\t#  N1 Поиск выполняется строго по описанным критериям т.е Eсли написанно > Поиск файла по расширению то поиск #" << endl;
	cout << "\t\t\t\t\t\t\t\t#     будет вестись только по расширениям (.txt .bat .exe и другие)                                           #" << endl;
	
	

}